      ******************************************************************
      *  Author: Kevin Arnold 
      *  Date: 23/06/2025
      *  Purpose: Tipos de datos
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. P0393.
       AUTHOR. KEVIN ARNOLD.
       DATE-WRITTEN. 23/06/2025.
              
       DATA DIVISION.       
       WORKING-STORAGE SECTION.
      ******************************************************************
      *NIVELES DE JERARQUIA PARA CADA CASO DE USO
      *01-49 TIENEN JERARQUIA
      *66 SOLO PARA VARIABLES CON CLAUSULA RENAMES
      *77 VARIABLES NO TIENEN JERARQUIA
      *88 PARA USAR EN CONDICIONALES
      ******************************************************************

      *VARIABLES POR TIPO DE DATO
       01 WS-STUDENT.
      *Alfanumericas
          03 WS-USERNAME      PIC X(10)       VALUE "KEVAR12340".
          03 WS-FILLER        PIC A(01)       VALUE SPACES.
      *Numéricas
          03 WS-AGE           PIC 9(3)        VALUE 24.
          03 WS-CALIFICATION  PIC S9(2)       VALUE -24.
          03 WS-WEIGHT        PIC 9(3)V9(2)   VALUE 69.80.
          03 WS-DEBT          PIC 9(5)V9(2)   VALUE 2760.50.
      *Alfabeticas
          03 WS-PROFILE.
             05 WS-NAME       PIC A(12)       VALUE "KEVIN ARNOLD".
             05 WS-FILLER1    PIC A(01)       VALUE SPACES.
             05 WS-LAST-NAME  PIC A(14)       VALUE "FLORES PACHECO".
      *CLAUSULA REDEFINE -> OJO SE REFEDINE JUSTO DESPUES DE DEFINIR LA 
      *VARIABLE A REDEFINIR Y DEBEN TENER EL MISMO NIVEL JERARQUICO
           03 WS-PROFILE-NAME REDEFINES WS-PROFILE PIC X(27).
           *>SALIDA ESPERADA: KEVIN ARNOLD FLORES PACHECO   

      *CLAUSULA "WS-RENAME: "RENAME -> USAR EL NIVEL 66 SIEMPRE
      *Y SE USA DESPUES DE LAS VARIABLES
       66 WS-RENAME RENAMES WS-USERNAME THRU WS-AGE. *> KEVAR12340 024

      *CONSTANTES FIGURATIVAS -> SINGULAR Y PLURAL
       01 WS-SPACES           PIC X(3)        VALUE SPACES.
       01 WS-ZEROES           PIC X(3)        VALUE ZEROES.
       01 WS-QUOTES           PIC X(3)        VALUE QUOTES.
       01 WS-HIGH-VALUE       PIC X           VALUE HIGH-VALUE.
       01 WS-LOW-VALUE        PIC X           VALUE LOW-VALUE.

      *DATOS EMPAQUETADOS - MAXIMO 18 BYTES
      *COMP -> COMPUTATIONAL
      *EXISTE COMP2 COMP4 ...  PERO COMP Y COMP3 SON LOS MAS USADOS  
      *FORMATO COMP PARA ENTEROS
      *FORMATO COMP3 PARA DECIMALES
      *n = IMPAR -> SUMAR 1 Y DIVIDE 2 | PAR -> DIVIDE 2 Y SUMAR 1
       01 WS-COMPNUM          PIC S9(3) COMP VALUE 2000.

      *DATOS EDITADOS O CONVERTIDOS A MONEDA $, CON COMAS Y SIN CEROS
       01 WS-WEIGHT-OUTPUT    PIC 999.99. *>
       01 WS-WEIGHT-NO-ZEROS  PIC ZZZ.99. *>
       01 WS-DEBT-OUTPUT      PIC $ZZZ,ZZZ.99. *>

      *OUTPUT CON MOVES
       01 WS-USERNAME-OUTPUT  PIC X(5).
       
       PROCEDURE DIVISION.
      *****MOVE EN NUMERICOS(ENTEROS Y DECIMALES)
      * SI LA LONGITUD DE LA VARIABLE ES < DE TRUNCA A LA IZQUIERDA
      * SI LA LONGITUD DE LA VARIABLE ES > SE AUMENTAN 0    
      * SI LA LONGITUD DE LOS DECIMALES ES < SE TRUNCA A LA DERECHA
           MOVE WS-WEIGHT TO WS-WEIGHT-OUTPUT.
           MOVE WS-WEIGHT TO WS-WEIGHT-NO-ZEROS.
           MOVE WS-DEBT TO WS-DEBT-OUTPUT.
           
      *****MOVE EN ALFANUMERICOS
           *> SI LA LONGITUD DE LA VARIABLE ES < SE TRUNCA A LA DERECHA
           MOVE WS-USERNAME TO WS-USERNAME-OUTPUT. *> KEVAR

           DISPLAY 'Tipos de datos OK!'.
           DISPLAY "PROFILE REDEFINIDO: " WS-PROFILE-NAME.
           DISPLAY "WS-SPACES: " WS-SPACES.
           DISPLAY "WS-ZEROS: " WS-ZEROES.
           DISPLAY "WS-QUOTES: " WS-QUOTES.
           DISPLAY "WS-HIGH-VALUE: " WS-HIGH-VALUE.
           DISPLAY "WS-LOW-VALUE: " WS-LOW-VALUE.
           DISPLAY "WS-RENAME: " WS-RENAME.
           DISPLAY "MOVE-USERNAME: " WS-USERNAME-OUTPUT.
           DISPLAY "DEUDA: " WS-DEBT-OUTPUT.
           DISPLAY "PESO OUTPUT: " WS-WEIGHT-OUTPUT.
           DISPLAY "PESO SIN ZEROS: " WS-WEIGHT-NO-ZEROS.
           DISPLAY "COMPUTATION-VALUE: " WS-COMPNUM.
           STOP RUN.
       END PROGRAM P0393.              