      ******************************************************************
      *  Author: Kevin Arnold 
      *  Date: 30/06/2025
      *  Purpose: Behance ibm calculate with file
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. P0IBMFILE.
       AUTHOR. KEVIN ARNOLD.
       DATE-WRITTEN. 23/06/2025.
       
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       
       DATA DIVISION.
       FILE SECTION.       
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
           DISPLAY 'Area de ejecución'.
           STOP RUN.
       END PROGRAM P0IBMFILE.


