      ** Variables de fecha y hora del sistema
       01 FECHA-SIS             PIC 9(08).     *> Formato: YYYYMMDD 
       01 HORA-SIS              PIC 9(06).     *> Formato: HHMMSS